app_rails/app/controllers/appointments_controller.rb

  def index
    @appointments = Appointment.all
---
SELECT `appointments`.* FROM `appointments`

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO `appointments` (`professional_id`, `name`, `surname`, `phone`, `notes`, `date`, `created_at`, `updated_at`) VALUES (1, 'benja', 'freccero', '213213', 'asjdjadsj', '2021-11-10 21:53:00', '2021-11-10 21:54:06.437907', '2021-11-10 21:54:06.437907')

  def destroy
    @appointment.destroy
---
DELETE FROM `appointments` WHERE `appointments`.`id` = 8

    def set_appointment
      @appointment = Appointment.find(params[:id])
---
SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`id` = 2 LIMIT 1