app_rails/app/controllers/appointments_controller.rb

    def set_professional
      @professional = Professional.find(params[:professional_id])
---
SELECT `professionals`.* FROM `professionals` WHERE `professionals`.`id` = 0 LIMIT 1