app_rails/app/controllers/professionals_controller.rb

SELECT `professionals`.* FROM `professionals`
---
  def index
    @professionals = Professional.all

INSERT INTO `professionals` (`name`, `created_at`, `updated_at`) VALUES ('jorge', '2021-11-10 21:50:38.766084', '2021-11-10 21:50:38.766084')
---
  def create
    @professional = Professional.new(professional_params)

    respond_to do |format|
      if @professional.save

DELETE FROM `professionals` WHERE `professionals`.`id` = 7
---
  def destroy
    if @professional.destroy

SELECT `professionals`.* FROM `professionals` WHERE `professionals`.`id` = 12 LIMIT 1
---
    def set_professional
      @professional = Professional.find(params[:id])