app_rails/app/models/professional.rb

  def find_appointment(appointment)
    puts self.appointments.where("date = ? AND id != ?", appointment.date, appointment.id).exists?
---
SELECT 1 AS one FROM `appointments` WHERE `appointments`.`professional_id` = 11 LIMIT 1